Merge remote-tracking branch 'origin/release/azure_data_cosmos-previews' into retry-logics
